# 配列の中に配列を含める
a = [[1, 2, 3],[4, 5, 6]]

# 配列の要素取得
a[0] #=> [1, 2, 3]
a[0][0] #=> 1

# 配列の要素の個数取得
a.size #=> 2
a[0].size #=> 3

# 要素の変更
a = [10, 20, 30]
a[1] = 2
a #=> [10, 2, 30]

# 元より大きい添字を指定すると間がnilで埋められる
a[5] = 60 #=> [10, 2, 30, nil, nil, 60]

# 要素を末尾に追加
a << 70 #=> [10, 2, 30, nil, nil, 60, 70]

# 要素を削除
a.delete_at(1) #=> [10, 30, nil, nil, 60, 70]

# 多重代入
a, b = [10, 20]
a #=> 10
b #=> 20

c, d = [10]
c #=> 10
d #=> nil

# 商業の余を配列で返すメソッド
quo_rem = 40.divmod(6)
"商=#{quo_rem[0]}, 余り=#{quo_rem[1]}" #=>=> "商=6, 余り=4"
